In [174]:
import pandas as pd
block = pd.read_clipboard(sep='\t')
block

                                         1 2605/0800
0                                     2 6445N/04030E
1                                            4 300/8
2                                              5 0/0
3                                       26 2105/1825
4                                             27 ТВА
5                                      31 88,3/137,4
6                                     43 Архангельск
7                                      100 Груза нет
8  Установка береговыми специалистами видеокамер ...

In [175]:
COLUMN_NAMES = [l for l in range(0, 102)]
df = pd.DataFrame(columns=COLUMN_NAMES, index=[0])
df

,0,1,2,3,4,5,6,7,8,9,...,92,93,94,95,96,97,98,99,100,101
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [176]:
block.T.reset_index().values[0][0]

'1 2605/0800'

In [177]:
list_data = block.T.reset_index().values
list_data[0][0].split()

['1', '2605/0800']

In [220]:
list_data

array([['1 2605/0800', '2 6445N/04030E', '4 300/8', '5 0/0',
        '26 2105/1825', '27 ТВА', '31 88,3/137,4', '43 Архангельск',
        '100 Груза нет',
        'Установка береговыми специалистами видеокамер согласно Транспортной безопасности ']],
      dtype=object)

In [178]:
len(list_data[0])

10

In [215]:
for i in range(len(list_data[0])):
    if list_data[0][i].split()[0].isdigit():
        df.iloc[0, int(list_data[0][i].split()[0])] = ' '.join(list_data[0][i].split()[1:][:])
    else:
        df.iloc[0, 101] = list_data[0][i]

In [216]:
df

,0,1,2,3,4,5,6,7,8,9,...,92,93,94,95,96,97,98,99,100,101
0,NaN,2605/0800,6445N/04030E,NaN,300/8,0/0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Груза нет,Установка береговыми специалистами видеокамер ...

In [217]:
df.dropna(axis=1).info()

<class 'pandas.core.frame.DataFrame'>
Index: 1 entries, 0 to 0
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   1       1 non-null      object
 1   2       1 non-null      object
 2   4       1 non-null      object
 3   5       1 non-null      object
 4   26      1 non-null      object
 5   27      1 non-null      object
 6   31      1 non-null      object
 7   43      1 non-null      object
 8   100     1 non-null      object
 9   101     1 non-null      object
dtypes: object(10)
memory usage: 88.0+ bytes

In [218]:
df.dropna(axis=1)

,1,2,4,5,26,27,31,43,100,101
0,2605/0800,6445N/04030E,300/8,0/0,2105/1825,ТВА,"88,3/137,4",Архангельск,Груза нет,Установка береговыми специалистами видеокамер ...

In [223]:
len(df.values.tolist())

1

In [225]:
df.to_dict()

{0: {0: nan},
 1: {0: '2605/0800'},
 2: {0: '6445N/04030E'},
 3: {0: nan},
 4: {0: '300/8'},
 5: {0: '0/0'},
 6: {0: nan},
 7: {0: nan},
 8: {0: nan},
 9: {0: nan},
 10: {0: nan},
 11: {0: nan},
 12: {0: nan},
 13: {0: nan},
 14: {0: nan},
 15: {0: nan},
 16: {0: nan},
 17: {0: nan},
 18: {0: nan},
 19: {0: nan},
 20: {0: nan},
 21: {0: nan},
 22: {0: nan},
 23: {0: nan},
 24: {0: nan},
 25: {0: nan},
 26: {0: '2105/1825'},
 27: {0: 'ТВА'},
 28: {0: nan},
 29: {0: nan},
 30: {0: nan},
 31: {0: '88,3/137,4'},
 32: {0: nan},
 33: {0: nan},
 34: {0: nan},
 35: {0: nan},
 36: {0: nan},
 37: {0: nan},
 38: {0: nan},
 39: {0: nan},
 40: {0: nan},
 41: {0: nan},
 42: {0: nan},
 43: {0: 'Архангельск'},
 44: {0: nan},
 45: {0: nan},
 46: {0: nan},
 47: {0: nan},
 48: {0: nan},
 49: {0: nan},
 50: {0: nan},
 51: {0: nan},
 52: {0: nan},
 53: {0: nan},
 54: {0: nan},
 55: {0: nan},
 56: {0: nan},
 57: {0: nan},
 58: {0: nan},
 59: {0: nan},
 60: {0: nan},
 61: {0: nan},
 62: {0: nan},
 63: {0: nan},
 64: {0: nan},
 65: {0: nan},
 66: {0: nan},
 67: {0: nan},
 68: {0: nan},
 69: {0: nan},
 70: {0: nan},
 71: {0: nan},
 72: {0: nan},
 73: {0: nan},
 74: {0: nan},
 75: {0: nan},
 76: {0: nan},
 77: {0: nan},
 78: {0: nan},
 79: {0: nan},
 80: {0: nan},
 81: {0: nan},
 82: {0: nan},
 83: {0: nan},
 84: {0: nan},
 85: {0: nan},
 86: {0: nan},
 87: {0: nan},
 88: {0: nan},
 89: {0: nan},
 90: {0: nan},
 91: {0: nan},
 92: {0: nan},
 93: {0: nan},
 94: {0: nan},
 95: {0: nan},
 96: {0: nan},
 97: {0: nan},
 98: {0: nan},
 99: {0: nan},
 100: {0: 'Груза нет'},
 101: {0: 'Установка береговыми специалистами видеокамер согласно Транспортной безопасности '}}